var descList={
		"亲密度":{
			"1":"您的得分低于常模指数范围，说明您的得分低于大多数人。处于您这个分数段的典型家庭特征是：家庭成员关系较为疏远，很少有人愿意为家庭做出贡献或牺牲，也不愿对彼此承诺什么，较少出现相互帮助和支持的现象。建议多组织一些集体活动，让大家感受互帮互助的氛围，拉近家庭成员之间的关系。",
			"2":"您的得分在常模指数范围内，说明您的得分与大多数人相当。处于您这个分数段的典型家庭特征是：家庭成员亲密程度一般。通常情况下，成员愿意为家庭做出贡献，为他人提供帮助和支持，家庭气氛较和谐。",
			"3":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：家庭成员关系非常亲密，每位成员都愿意为家庭做出贡献，对其他成员做出忠实的承诺，提供极大的支持和无私的帮助，家庭气氛非常和谐。"
		},"情感表达":{
			"1":"您的得分低于常模指数范围，说明您的得分低于大多数人。处于您这个分数段的典型家庭特征是：家庭成员很少公开表达情感、表露感受，即使表达情感也有所顾忌。建议通过恰当的方式鼓励家庭成员分享各自的喜怒哀乐，共建家的温馨。",
			"2":"您的得分在常模指数范围内，说明您的得分与大多数人相当。处于您这个分数段的典型家庭特征是：家庭成员有时会公开表达自己的愉悦或烦恼，同时会兼顾彼此的感受。大家有时会公开讨论一些成员关注的问题。",
			"3":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：家庭成员经常讨论共同关注的问题，公开地表达自己的喜怒哀乐。而家庭成员也会相互体谅彼此的感受。"
		},"矛盾性":{
			"1":"您的得分低于常模指数范围，说明您的得分低于大多数人。处于您这个分数段的典型家庭特征是：彼此之间的矛盾较少，有矛盾时通常也不会以激烈的形式公开表现，尽量保持和气的家庭氛围。",
			"2":"您的得分在常模指数范围内，说明您的得分与大多数人相当。处于您这个分数段的典型家庭特征是：家庭成员之间存在一些矛盾，有时会出现争吵、发脾气、打架等攻击其他成员的现象。建议多多换位思考，尝试设身处地地从对方角度考虑问题，从而采取理性的方式来解决问题，让家庭呈现和气的氛围。",
			"3":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：彼此之间的矛盾较多，且经常以争吵、打架等形式攻击对方、发泄自己的怒气。建议多多换位思考，尝试设身处地地从对方角度考虑问题，从而采取理性的方式解决问题，让家庭呈现和气的氛围。"
		},"独立性":{
			"1":"您的得分低于常模指数范围，说明您的得分低于大多数人。处于您这个分数段的典型家庭特征是：家庭成员依赖性较高，遇到问题时通常由家里人共同解决，而不是让某个成员独自面对。家庭成员的互帮互助让成员感受到彼此的关心和支持，但应鼓励成员多独立解决问题。",
			"2":"您的得分在常模指数范围内，说明您的得分与大多数人相当。处于您这个分数段的典型家庭特征是：家庭鼓励成员独立面对、解决问题，家庭成员具有一定的独立性，在处理事情时也会参考家庭其他成员的意见。",
			"3":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：家庭非常鼓励、赞成成员自尊、自主、自立，成员独立性很高，没有哪个人特别依赖整个家庭或某位家庭成员。"
		},"成功性":{
			"1":"您的得分低于常模指数范围，说明您的得分低于大多数人。处于您这个分数段的典型家庭特征是：对于学习或工作，家庭成员没有人特别在意是否成功，大家不会为了职位的晋升、成绩的提高等付出大的努力。",
			"2":"您的得分在常模指数范围内，说明您的得分与大多数人相当。处于您这个分数段的典型家庭特征是：对于学习或工作中的事情，家庭成员会参与各种竞争，并在意其成败。大家会为了获得良好的成绩而付出较大的努力。",
			"3":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：不论在学习中还是在工作中，大家都积极参加竞争，并力争取得成功，为了获得好成绩而不懈努力。"
		},"知识性":{
			"1":"您的得分低于常模指数范围，说明您的得分低于大多数人。处于您这个分数段的典型家庭特征是：家里很少有人对政治、社会、智力和文化活动有较大兴趣，大家在这些事情上不会花费太多的时间和精力。",
			"2":"您的得分在常模指数范围内，说明您的得分与大多数人相当。处于您这个分数段的典型家庭特征是：家庭成员关注知识，学习氛围较好，成员愿意花一定的时间进行学习、参与政治、社会、智力和文化等活动。",
			"3":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：家庭成员求知欲强，学习氛围浓重，每个人都愿意花一定的时间去学习、参与政治、社会、智力和文化活动。"
		},"娱乐性":{
			"1":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：家庭娱乐活动、社交活动很多，经常去看电影、郊游、参加体育运动和朋友聚会等。",
			"2":"您的得分在常模指数范围内，说明您的得分与大多数人相当。处于您这个分数段的典型家庭特征是：家庭中有时会组织一些娱乐活动，如郊游、看电影、观看体育比赛等。成员时常参加一些聚会等社交活动。",
			"3":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：家庭成员求知欲强，学习氛围浓重，每个人都愿意花一定的时间去学习、参与政治、社会、智力和文化活动。"
		},"道德宗教观":{
			"1":"您的得分低于常模指数范围，说明您的得分低于大多数人。处于您这个分数段的典型家庭特征是：社会伦理道德对家人的行为没有特别大的限制，觉得尊老爱幼、帮助老弱病残、爱护公共环境等社会公德似乎与个人生活没有多大的关系。",
			"2":"您的得分在常模指数范围内，说明您的得分与大多数人相当。处于您这个分数段的典型家庭特征是：家庭成员为人处事一般会遵循社会伦理道德，尊老爱幼、帮助老弱病残、爱护公共环境等。",
			"3":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：社会伦理道德是家人做事的重要标准，大家会自愿遵守社会公德、尊老爱幼、帮助老弱病残、爱护公共环境等。"
		},"组织性":{
			"1":"您的得分低于常模指数范围，说明您的得分低于大多数人。处于您这个分数段的典型家庭特征是：家庭安排活动或分配责任缺乏组织性，各自的责任不太明确，成员做事也没有条理性。",
			"2":"您的得分在常模指数范围内，说明您的得分与大多数人相当。处于您这个分数段的典型家庭特征是：在家庭活动的安排或家庭责任的分配上具有一定的组织性，大家的分工、责任较明确。",
			"3":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：家庭活动安排井然有序，责任分配明确，大家争取把事情做得井井有条。"
		},"控制性":{
			"1":"您的得分低于常模指数范围，说明您的得分低于大多数人。处于您这个分数段的典型家庭特征是：家庭生活中没有固定的活动程序和规范，成员按照自己的方式、标准生活。",
			"2":"您的得分在常模指数范围内，说明您的得分与大多数人相当。处于您这个分数段的典型家庭特征是：家庭生活具有一定的规范和程序，大家也注意遵守，若有人违反，可能会受到一定的惩罚。",
			"3":"您的得分超过了常模指数范围，说明您的得分高于大多数人。处于您这个分数段的典型家庭特征是：家庭生活中有较为固定的活动程序和规范，并要求大家遵守，若有人违反，可能会受到如批评等惩罚。"
		}
}

$(function () {
	var data = $("#data").text();
	var json = JSON.parse(data)[0];
    var demion = json.data;
    var chartArray = [];
    var scoreArray = [];
    var descArray = [];
    for(var i=0 ; i<demion.length; i++){
    	var n1 = demion[i].name;
    	var s1 = parseInt(demion[i].score);
    	var demArray ={"name":n1,"y":s1};
    	chartArray[i]=demArray;
    	scoreArray[i]=s1;
    	var level = demion[i].level;
    	descArray[i]=descList[n1][level];
    }
    //图表数据加载
    $('#containerFamilyEnvironment').highcharts({
        chart: {
            type: 'column'
        },
        title: {
            text: null
        },
        xAxis: {
            categories: [
                '亲密度',
                '情感表达',
                '矛盾性',
                '独立性',
                '成功性',
                '知识性',
                '娱乐性',
                '道德宗教观',
                '组织性',
                '控制性'
            ],
            tickLength:0
        },
        yAxis: {
            min: 0,
            title: {
                text: null
            },
            tickInterval: 1
        },
        credits: {
            enabled:false
        },
        exporting: {
            enabled:false
        },
        tooltip: {
            enabled:false
        },
        legend: {
            enabled: false
        },
        plotOptions: {
            column: {
                pointPadding: 0.2,
                borderWidth: 0,
                dataLabels:{
                    enabled:true
                }
            }
        },
        series: [{
            data: chartArray
        }]
    });
    //数据展示
    for(var j= 0 ; j<10 ; j++){
    	$("#tableScore"+(j+1)).text(scoreArray[j]);
    	$("#desc"+(j+1)).append(descArray[j]);
    }
});